# IN CLASS LAB EXERCISE 03

In [0]:
import pandas as pd
import os

**Data Description:-**

**Survival**
0 = No, 1 = Yes

**pclass**
Ticket class
1 = 1st, 2 = 2nd, 3 = 3rd

**sex**
Sex

**Age**
Age in years

**sibsp**
siblings / spouses aboard the Titanic

**parch**
parents / children aboard the Titanic

**ticket**
Ticket number

**fare**
Passenger fare

**cabin**
Cabin number

**embarked**
Port of Embarkation
C = Cherbourg, Q = Queenstown, S = Southampton

**Q.no (1) . Write a code to load 'train.csv' as data1 & 'test.csv' as data2.**

In [0]:
from google.colab import files
uploaded = files.upload()
import io
data1 = pd.read_csv(io.BytesIO(uploaded['train.csv']))
print(data1.head(2))

Saving train.csv to train (2).csv
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [0]:
from google.colab import files
uploaded = files.upload()
import io
data2 = pd.read_csv(io.BytesIO(uploaded['test.csv']))
print(data2.head(2))

Saving test.csv to test (3).csv
   PassengerId  Pclass                              Name  ...    Fare  Cabin  Embarked
0          892       3                  Kelly, Mr. James  ...  7.8292    NaN         Q
1          893       3  Wilkes, Mrs. James (Ellen Needs)  ...  7.0000    NaN         S

[2 rows x 11 columns]

----

**Q.no (2) . Write a code to `concanate` data1 & data2 assign it as  `data_01`.**

In [0]:
print(data1.shape)
print(data2.shape)
data_01 = pd.concat([data1,data2],sort=False)
data_01.shape

(891, 12)
(418, 11)

(1309, 12)

---------------------------

**Q.no(3).Write a code to `MERGE`(`outer`)  data1 & data2 as `data`.**

In [0]:
data1_merged = pd.merge(left =data1 ,right=data2,right_on = 'PassengerId',left_on='PassengerId',how='outer' )
data1_merged.head()

   PassengerId  Survived  Pclass_x  ... Fare_y Cabin_y  Embarked_y
0            1       0.0       3.0  ...    NaN     NaN         NaN
1            2       1.0       1.0  ...    NaN     NaN         NaN
2            3       1.0       3.0  ...    NaN     NaN         NaN
3            4       1.0       1.0  ...    NaN     NaN         NaN
4            5       0.0       3.0  ...    NaN     NaN         NaN

[5 rows x 22 columns]

----

**Q.no(4).Write a code to `JOIN`(`inner`) data1 & data2 as `data11`.**

-----------

**Q.no(5) . Write a code to `RENAME` the column from `sex` to `gender` and assign it to the new dataframe named as `data_02`.**

In [0]:
data_02 = data1.rename(columns={'Sex':'gender'})
data_02.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

--------------

**Q.no(6) . Write a code to `drop` the column 'Ticket' and assign it to the new dataframe named as `data_03`.**

In [0]:
data_03 = data1.drop('Ticket',axis=1)
data_03.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 11 columns]

-----

**Q.no(7) . Write a code to `drop` the first five  `rows` of `data_03` as per there `index position`  .**

In [0]:
data_03.drop([0,1,2,3,4]).head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 11 columns]

-----

**Q.no(8) . Write a code to `drop` the `column no. 2 ` of `data_03` as per there `index position` .**

------

**Q.no(9). Write a code to replace all the `3` in the `Pclass` to `2` of `data_02`and assign it to the new dataframe named as `data_04`.**

In [0]:

data_04 = data_02[data_02['Pclass']==3]['Pclass'].replace(3,2)
data_04.head()

0    2
2    2
4    2
5    2
7    2
Name: Pclass, dtype: int64

-------

**Q.no(10). Write a code to `map` all the females who are in `Pclass - 1` and males in `Pclass - 2` in `data_02`.**

In [0]:
#data_02.head()
data_males = data_02[(data_02['Pclass']==2)&(data_02['gender']=='male')]
data_females=data_02[(data_02['Pclass']==1)&(data_02['gender']=='female')]
data_mapped = pd.concat([data_males,data_females])

data_mapped.head()

    PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
17           18         1       2  ...  13.0   NaN         S
20           21         0       2  ...  26.0   NaN         S
21           22         1       2  ...  13.0   D56         S
33           34         0       2  ...  10.5   NaN         S
70           71         0       2  ...  10.5   NaN         S

[5 rows x 12 columns]

--------------------

**Q.no(11). Write a code to identify duplicates in `Cabin` column and show a `count` of it from `data_02`.**

In [0]:
data_02['Cabin'].value_counts().head()

G6             4
C23 C25 C27    4
B96 B98        4
E101           3
F33            3
Name: Cabin, dtype: int64

----------------

**Q.no(12). Write a code to `drop` all duplicates in `Fare` column from `data_03` and show `info()`.**

In [0]:
data_03

AttributeError: ignored

-----

**Q.no(13). Write a code to `show the summary statistics` for all numeric columns of  `data_01`.**

In [0]:
data_01.describe()

       PassengerId    Survived  ...        Parch         Fare
count  1309.000000  891.000000  ...  1309.000000  1308.000000
mean    655.000000    0.383838  ...     0.385027    33.295479
std     378.020061    0.486592  ...     0.865560    51.758668
min       1.000000    0.000000  ...     0.000000     0.000000
25%     328.000000    0.000000  ...     0.000000     7.895800
50%     655.000000    0.000000  ...     0.000000    14.454200
75%     982.000000    1.000000  ...     0.000000    31.275000
max    1309.000000    1.000000  ...     9.000000   512.329200

[8 rows x 7 columns]

-----

**Q.no(14). Write a code to `show the summary statistics` for all columns that including 'categorical columns' of  `data_01`.**

In [0]:
data_01.describe(include='all')

        PassengerId    Survived       Pclass  ...         Fare        Cabin  Embarked
count   1309.000000  891.000000  1309.000000  ...  1308.000000          295      1307
unique          NaN         NaN          NaN  ...          NaN          186         3
top             NaN         NaN          NaN  ...          NaN  C23 C25 C27         S
freq            NaN         NaN          NaN  ...          NaN            6       914
mean     655.000000    0.383838     2.294882  ...    33.295479          NaN       NaN
std      378.020061    0.486592     0.837836  ...    51.758668          NaN       NaN
min        1.000000    0.000000     1.000000  ...     0.000000          NaN       NaN
25%      328.000000    0.000000     2.000000  ...     7.895800          NaN       NaN
50%      655.000000    0.000000     3.000000  ...    14.454200          NaN       NaN
75%      982.000000    1.000000     3.000000  ...    31.275000          NaN       NaN
max     1309.000000    1.000000     3.000000  ...   512.329200          NaN       NaN

[11 rows x 12 columns]

---------------

**Q.no(15). Write a code to show `average` `age` of all the passengers of `data_01`.**

In [0]:
data_01['Age'].mean()

29.881137667304014

-------------------

**Q.no(16). Write a code to show the Middle value in `Survived` column of all the passengers from `data_01`.**

In [0]:
data_01['Survived'].median()

0.0

-----------------

**Q.no(17). Write a code to show mostly paid fare by all the passengers from `data_01`.**

In [0]:
data_01['Fare'].value_counts().head(1).index[0]

8.05

---------------

**Q.no(18). Write a code to show how much do the `fare` is `skewed` in `data_01`.**

In [0]:
data_01.skew()['Fare']

4.367709134122922

------------

**Q.no(19). Write a code to show how much is the `kurtosis` in `Age` column for data_01.**

-------

**Q.no(20).Write a code to show the `average age` of all the genders as per there respective `passenger class(Pclass)` for data_01.**

In [0]:
data_01.groupby(['Pclass','Sex']).agg({'Age':'mean'})

                     Age
Pclass Sex
1      female  37.037594
       male    41.029272
2      female  27.499223
       male    30.815380
3      female  22.185329
       male    25.962264

--------------

**Q.no(21). Write a code to show the `average fare` for all `individual` `'Pclass'`.**

In [0]:
data_01.groupby(['Pclass']).agg({'Fare':'mean'})

             Fare
Pclass
1       87.508992
2       21.179196
3       13.302889

----------

# -----------------------------------HAPPY LEARNING-----------------------------------------

------